Autodesk.Revit.DB.ParameterMap
A map that can contain a mapping of a parameter name (a String) to a parameter.

Autodesk.Revit.DB.ParameterMap.Insert(System.String,Autodesk.Revit.DB.Parameter)
System.Int32
Insert the specified item with the specified key into the map.
key: The key to be used for inserting the item into the map.
item: The item to be inserted into the map.
Returns: Returns whether the item was inserted into the map.

Autodesk.Revit.DB.ParameterMap.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the map.
Returns: Returns a forward moving iterator to the map.

Autodesk.Revit.DB.ParameterMap.ReverseIterator
Autodesk.Revit.DB.ParameterMapIterator
Retrieve a backward moving iterator to the map.
Returns: Returns a backward moving iterator to the map.

Autodesk.Revit.DB.ParameterMap.ForwardIterator
Autodesk.Revit.DB.ParameterMapIterator
Retrieve a forward moving iterator to the map.
Returns: Returns a forward moving iterator to the map.

Autodesk.Revit.DB.ParameterMap.Erase(System.String)
System.Int32
Removes a object with the specified key from the map.
key: The key of the item to be erased.
Returns: The number of items that were erased from the map.

Autodesk.Revit.DB.ParameterMap.Contains(System.String)
System.Boolean
Tests for the existence of a key within the map.
key: The key to be searched for.
Returns: The Contains method returns True if the key is within the map, otherwise False.

Autodesk.Revit.DB.ParameterMap.Clear
void
Removes every item from the map, rendering it empty.

Autodesk.Revit.DB.ParameterMap.Size
System.Int32
get
Returns the number of objects that are in the map.

Autodesk.Revit.DB.ParameterMap.Item(System.String)
System.Object
Gets or sets an item at a specified key within the map.
key: The key of the item to be set or retrieved.
Returns: Returns the object at the specified key.

Autodesk.Revit.DB.ParameterMap.IsEmpty
System.Boolean
get
Test to see if the map is empty.
Remarks: If the map is empty then True will be returned, otherwise False.